package ru.alfabank.tasks_w5;

public class ParamDemo {
    //Странная задача, т.к. не описано, что должны делать методы
//    Если перейти к сути того, что нужно было понять из задачи:
//    "Объясните почему int/String не меняются, а массив/объект меняются"
//    Ответ: в переменных объекта и массива хранятся ссылки на объекты, в отличие от примитивных типов и String-а
//    Соответственно метод, принимающий параметрами объект/массив
//    изменит непосредственно объект/массив, находящийся по этой ссылке
}
